updated diagrams in readme and code fixes
